Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/atdf/PIC32MZ1064DAL169.atdf
      <value-group caption="SD Bus Power bit" name="SDHCCON1__SDBP">
         <value caption="Bus power is on" name="" value="0x1" />
         <value caption="Bus power is off" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop at Block Gap Request bit" name="SDHCCON1__SBGREQ">
         <value caption="Stop" name="" value="0x1" />
         <value caption="Transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Continue Request bit" name="SDHCCON1__CONTREQ">
         <value caption="Restart" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="Read Wait Control bit" name="SDHCCON1__RDWTCON">
         <value caption="Read wait control is enabled" name="" value="0x1" />
         <value caption="Read wait control is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt at Block Gap bit" name="SDHCCON1__INTBG">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Event Enable on SD Card Interrupt bit" name="SDHCCON1__WKONINT">
         <value caption="Wake-up event is enabled" name="" value="0x1" />
         <value caption="Wake-up event is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Event Enable on SD Card Insertion bit" name="SDHCCON1__WKONINS">
         <value caption="Wake-up event is enabled" name="" value="0x1" />
         <value caption="Wake-up event is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Event Enable on SD Card Removal bit" name="SDHCCON1__WKONREM">
         <value caption="Wake-up event is enabled" name="" value="0x1" />
         <value caption="Wake-up event is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Clock Enable bit" name="SDHCCON2__ICLKEN">
         <value caption="Oscillate" name="" value="0x1" />
         <value caption="Stop" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Clock Stable bit" name="SDHCCON2__ICLKSTABLE">
         <value caption="Internal clock is ready" name="" value="0x1" />
         <value caption="Internal clock is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="SD Clock Enable bit" name="SDHCCON2__SDCLKEN">
         <value caption="SD clock is enabled" name="" value="0x1" />
         <value caption="SD clock is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Time-out Counter Value bits" name="SDHCCON2__DTOC">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Time-out clock x 227" name="" value="0xe" />
         <value caption="Time-out clock x 214" name="" value="0x1" />
         <value caption="Time-out clock x 213" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset for All bit" name="SDHCCON2__SWRALL">
         <value caption="Issue reset command and reinitialize the SD card" name="" value="0x1" />
         <value caption="Divided Clock mode is selected" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset for CMD Line bit" name="SDHCCON2__SWRCMD">
         <value caption="Clears Present State and Interrupt Status registers and CMD bits" name="" value="0x1" />
         <value caption="Continue operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Software Reset for DATA Line bit" name="SDHCCON2__SWRDATA">
         <value caption="DMA and part of the data logic are reset" name="" value="0x1" />
         <value caption="Continue operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Block Gap Interrupt Flag bit" name="SDHCINTSTAT__BGIF">
         <value caption="Transaction stopped at block gap" name="" value="0x1" />
         <value caption="No block gap event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Status bit" name="SDHCINTSTAT__DMAIF">
         <value caption="DMA interrupt was generated" name="" value="0x1" />
         <value caption="DMA interrupt was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Write Ready Interrupt Flag bit" name="SDHCINTSTAT__BWRDYIF">
         <value caption="Ready to write buffer" name="" value="0x1" />
         <value caption="Not ready to write buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Read Ready Interrupt Flag bit" name="SDHCINTSTAT__BRRDYIF">
         <value caption="Ready to read buffer" name="" value="0x1" />
         <value caption="Not ready to read buffer" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Insertion Interrupt Flag bit" name="SDHCINTSTAT__CARDIIF">
         <value caption="Card has been inserted" name="" value="0x1" />
         <value caption="Card state is stable or debouncing" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Removal Interrupt Flag bit" name="SDHCINTSTAT__CARDRIF">
         <value caption="Card has been removed" name="" value="0x1" />
         <value caption="Card state is stable or debouncing" name="" value="0x0" />
      </value-group>
      <value-group caption="Card Interrupt Status bit" name="SDHCINTSTAT__CARDIF">
         <value caption="Generate card interrupt" name="" value="0x1" />
         <value caption="Do not generate card interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Error Interrupt Flag bit" name="SDHCINTSTAT__EIF">
         <value caption="Error was detected" name="" value="0x1" />
         <value caption="No error was detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Command Time-out Error Interrupt Flag bit" name="SDHCINTSTAT__CTOEIF">
         <value caption="Command time-out error has occurred" name="" value="0x1" />
         <value caption="Command time-out error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Command CRC Error Interrupt Flag bit" name="SDHCINTSTAT__CCRCEIF">
         <value caption="Command CRC error has occurred" name="" value="0x1" />
         <value caption="Command CRC error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Command End Bit Error Interrupt Flag bit" name="SDHCINTSTAT__CEBEIF">
         <value caption="End bit error was generated" name="" value="0x1" />
         <value caption="End bit error was not generated" name="" value="0x0" />
      </value-group>
      <value-group caption="Command Index Error Interrupt Flag bit" name="SDHCINTSTAT__CIDXEIF">
         <value caption="Command index error has occurred" name="" value="0x1" />
         <value caption="Command index error has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Time-out Error Interrupt Flag bit" name="SDHCINTSTAT__DTOEIF">
         <value caption="Data time-out error has occurred" name="" value="0x1" />
         <value caption="Data time-out error has not occurred" name="" value="0x0" />
      </value-group>
